{
    "albums": [
      {
        "id": 1,
        "date": "1989",
        "title": "Rock transgresivo",
        "description": "After recording a demo titled Rock transgressive in Duplimatic Studios in January 1989, the band would record and publish their first studio album Tú en tu casa, Nosotros en la hoguera with the Avispa record label that same year at M-20 Studios. Not being satisfied with the result of the latter; the original demo was partially re-recorded and remixed with the DRO record label, being released in August 1994 as the new studio album intended to replace the recording Tú en tu casa, Nosotros en la hoguera.",
        "poster": "https://cdn.grupoelcorteingles.es/SGFM/dctm/MEDIA02/CONTENIDOS/201403/04/00105110271433____1__640x640.jpg"
      },
      {
        "id": 2,
        "date": "1991",
        "title": "Somos unos animales",
        "description": "We are animals is the title of the second studio album by the Spanish rock band Extremoduro, produced by the same group for the Area Creativa label of Pasión Cía. Label, published in July 1991 exclusively in vinyl format.2 In 1995, DRO (which now owned the rights to the album) published the work in CD and cassette format on October 27 of that same year.3 A new edition with remastered versions and bonus tracks was released in 2011.4 The new vinyl edition was released on May 6, 2014 based on the remastered version.",
        "poster": "https://upload.wikimedia.org/wikipedia/en/5/59/Somosunosanimales1995.jpg"
      },
  
      {
        "id": 3,
        "date": "1992",
        "title": "Deltoya",
        "description": "Deltoya is the title of the third studio album by the Spanish rock band Extremoduro, released by DRO in June 1992.n. 1 Its distribution was made in the formats of CD, vinyl and cassette. For the last two it had to be divided into two vinyls and two cassettes respectively due to the length of the album.",
        "poster": "https://i.ytimg.com/vi/SYPefIcaQGQ/hqdefault.jpg"
      },
      {
        "id": 4,
        "date": "1993",
        "title": "¿Dónde están mis amigos?",
        "description": "Following the style already confirmed with Deltoya and again under the auspices of a major label like DRO, with which they will continue in the future, Extremoduro can afford to continue releasing one album a year, and in 1993 they present their fourth work. Already by this time they have revealed themselves as one of the most important groups on the Spanish national scene.",
        "poster": "https://i.ytimg.com/vi/jKh7xsKSz14/hqdefault.jpg"
      },
  
      {
        "id": 5,
        "date": "1995",
        "title": "Pedrá",
        "description": "The initial intention was for the project to be an independent band from Extremoduro, so it is not really an album by the group as such, but rather a collective work by the leader, vocalist and guitarist Robe Iniesta with various collaborators and friends from from other bands.",
        "poster": "https://i.ytimg.com/vi/WGkASmU2PIY/hqdefault.jpg"
      },
      {
        "id": 6,
        "date": "1996",
        "title": "Agila",
        "description": "Is the title of the sixth studio album by the Spanish rock band Extremoduro, produced by Iñaki Uoho Antón7 and published by DRO on February 23, 1996. Initially its distribution was made in CD and cassette formats. A new edition with remastered versions and a bonus track was released on May 25, 2011. The first vinyl edition was released on March 11, 2014 based on the remastered version.",
        "poster": "https://upload.wikimedia.org/wikipedia/en/6/6c/Ag%C3%ADlaExtremoduro.jpg"
      },
      {
        "id": 7,
        "date": "1997",
        "title": "Iros todos a tomar por culo",
        "description": "Iros todos a toma por culo is the title of the first live album by the Spanish rock band Extremoduro, produced by Uoho and published by DRO on April 21, 1997. Initially its distribution was made in CD and cassette formats, the remastered version was released in 20114 and the first vinyl edition was published on September 16, 2014 based on the remastered version.5.",
        "poster": "https://upload.wikimedia.org/wikipedia/en/c/cf/Iros_todos_a_tomar_por_culo.jpg"
      },
      {
        "id": 8,
        "date": "1998",
        "title": "Canciones prohibidas",
        "description": "Forbidden songs is the title of the seventh studio album by the Spanish rock band Extremoduro, produced by Uoho and published by the DRO label on September 28, 1998. Initially, its distribution was made in CD and cassette formats. A new edition with remastered versions and a bonus track was released in 2011.4 The first vinyl edition was published on September 16, 2014 based on the remastered version.",
        "poster": "https://m.media-amazon.com/images/I/518jMiyqW1L.jpg"
      },
  
      {
        "id": 9,
        "date": "2002",
        "title": "Yo, minoría absoluta",
        "description": "After a record break of four years since Canciones Prohibidas, released in 1998, Extremoduro released a new album in 2002 that flees from the artifice and complicated arrangements, including string and wind sections, of the latter. With Yo, absolute minority the group returns to the hard rock that has characterized it throughout its musical career.",
        "poster": "https://upload.wikimedia.org/wikipedia/en/8/8b/Yo%2C_minor%C3%ADa_absoluta.jpg"
      },
      {
        "id": 10,
        "date": "2008",
        "title": "La ley innata",
        "description": "It is a conceptual album composed of a single 45-minute song, divided into six parts differentiated by independent tracks. It was the band's first album to reach the top of the Spanish sales charts. After a week at number one in sales (surpassing Metallica in the week of their release) another two remained in the second. Market Stall.",
        "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/d/db/La_ley_innata.jpg/220px-La_ley_innata.jpg"
      },
  
      {
        "id": 11,
        "date": "2011",
        "title": "Material defectuoso",
        "description": "Edited by the multinational record company Warner, it was released on the market on May 24, 2011.4 The album debuted directly at number 1 on the Spanish sales list,5 and remained at the top of the list for four consecutive weeks.6 The first and only single was Tango Suicide, released on May 17, 2011.7.",
        "poster": "https://upload.wikimedia.org/wikipedia/en/9/9b/Material_defectuoso.jpg"
      },
      {
        "id": 12,
        "date": "2013",
        "title": "Para todos los públicos",
        "description": "It was distributed in compact disc, vinyl and digital album formats, for the latter a special mix was prepared with sound compression in mind.3 It had an intermittent and very long recording process, during the second half of 2011 the songs whose bases were recorded between February and March 2012 were prepared, and after the Robando perchas del hotel tour the recording was resumed, which ended in the spring of 2013.",
        "poster": "https://upload.wikimedia.org/wikipedia/en/2/28/Para_todos_los_p%C3%BAblicos.jpg"
      }
      
    ],
    
    "members": [
      {
        "id": 1,
        "name": "Roberto Inista",
        "bibliography": "Influenced by bands like AC/DC or Leño, in 1987 he formed the band Extremoduro. Not having the money required to afford a recording, they decided to sell tickets to anyone who wanted to contribute (at one thousand pesetas each), which would be worth a copy of the demo when it was recorded and edited. They came to sell 250 of these tickets, so they locked themselves in the Duplimatic studios in January 1989 and edited a print run of a thousand copies of this first demo entitled Rock transgressive, which was distributed throughout the Extremadura region. That same year, Avispa Music noticed Extremoduro, and offered them a three-year contract. In 1991, negotiations began with Avispa for the recording of the second album, but due to problems with diets, and due to the low expectations of future that the label offered them, they decide to break their contract and sign for the Creative Area label of Pasión Cía. Record company,6 again an independent company, but this time with better conditions and means. The economic differences due to not charging royalties led them inevitably to break with Pasión Cía. This made that at the end of that same year they signed for DRO, a subsidiary of Warner Music. At the beginning of 1993, Robe Iniesta moved to Barcelona and created the Q3. Robe dedicated all that time to composing and proposed to the record company to record a solo album but then he preferred to reject the precarious offer they proposed to him. Likewise, the members of Q3 replaced their former bandmates in Extremoduro. It was with this formation that, during the concerts of that same year and the following, they would make this time known as the era of chaos due to the anarchy and lack of foresight of their performances, probably due to personal experiences and problems. of Robe. Thus, the formation changed again and new members joined the band who were introduced to Robe by Iñaki Antón.",
        "poster": "https://res.cloudinary.com/dpq2gujpb/image/upload/v1665575280/robe_vl9tcs.jpg"
      },
      {
        "id": 2,
        "name": "Iñaki Antón",
        "bibliography": "He started playing with a group called Ke together with Juantxu Olano with whom he recorded a four-song demo. It was in 1989 when Platero y Tú was formed together with Fito, Juantxu and Jesús; which lasted until 2001. Since 1996 he is also a member of the Extremoduro group. In 2001, the year Platero and Tú split up, Adolfo Cabrales, Roberto Iniesta and Iñaki Antón recorded Basic Poesía, the only album from the Extrechinato y Tú project, intended to promote the figure of Manolo Chinato, a poet friend of Robe who had already collaborated with Extremoduro themselves and whose verses make up practically all the lyrics on the album, with the exception of Rojitas the ears, Embraced with sadness and If the sky is gray, which are the work of Adolfo Cabrales. In 2006, and before the break in composition of Extremoduro, Uoho starts the group Inconscientes together with Miguel Colino on bass and José Ignacio Cantera on drums; They are joined by Jon Calvo, vocalist and guitarist from Memoria de Pez, one of the groups on the Muxik staff.",
        "poster": "https://res.cloudinary.com/dpq2gujpb/image/upload/v1665575280/uh_jyuuay.jpg"
      },
  
      {
        "id": 3,
        "name": "José Ignacio Cantera",
        "bibliography": "José Ignacio Cantera is a Spanish rock drummer, member of the bands Extremoduro and Inconscientes. In 1997 he joined Extremoduro, a band in which Roberto Iniesta, and Iñaki Uoho Antón (producer and guitarist, at that time also of Platero y Tú, were already members. Since then they have released five studio albums. In 2001 he collaborated on Poesía basic, the only album of the Extrechinato y Tú project, aimed at extolling and promoting the figure of Manolo Chinato, a poet friend of Robe who had already collaborated with Extremoduro themselves and whose verses make up practically all the lyrics on the album. mostly recited by Chinato himself.",
        "poster": "https://res.cloudinary.com/dpq2gujpb/image/upload/v1665575280/33_yfbajx.jpg"
      },
      {
        "id": 4,
        "name": "Miguel Colino",
        "bibliography": "Miguel Ángel Colino is a rock bass player, member of the bands Extremoduro and Inconscientes. In 2001 he joined Extremoduro, a band in which Roberto Iniesta, Robe (leader, composer, guitarist and vocalist), Iñaki Uoho Antón (producer and guitarist, then also of Platero y Tú) and drummer Jose Ignacio Cantera. Since then, the line-up has remained stable and they have released four studio albums, not counting the greatest hits and flops compilation. In 1998 he recorded A Puerta Cerrado, the first album by Fito & Fitipaldis, a solo project by his friend Fito Cabrales, then also the vocalist and guitarist of Platero y Tú. From 1996 to 1998 he was part of the Portuguese group The Flying Rebollos.",
        "poster": "https://res.cloudinary.com/dpq2gujpb/image/upload/v1665575280/miguel_colino_jgqcvm.jpg"
      }
    ]
  }